{
  "registeredUsers": [
    {
      "id": 1,
      "email": "test1@test.com",
      "userName": "test1"
    },
    {
      "id": 2,
      "email": "test2@test.com",
      "userName": "test2"
    },
    {
      "id": 3,
      "email": "test3@test.com",
      "userName": "test3"
    }
  ],
  "users": [
    {
      "id": 1,
      "userName": "Javier Álvarez",
      "img": "https://media.licdn.com/dms/image/D4D35AQHjHfrBFr7GCQ/profile-framedphoto-shrink_200_200/0/1680119787771?e=1682038800&v=beta&t=0X-jV13DR53nuTcRCACjntlYtJMjUbOmm2i0j75LSDw",
      "email": "javier@javier.com"
    }
  ],
  "products": [
    {
      "id": "00002",
      "name": "Jordan Series Mid",
      "size": "41, 42, 44, 45",
      "price": 110,
      "color": "Obsidian/Sail/Sail",
      "type": "Zapatillas-Hombre",
      "description": "Lo clásico se combina con lo innovador en esta nueva versión del básico de la marca Jordan. La piel y el ante duraderos están reforzados con materiales sintéticos ligeros para ofrecer una mayor sujeción. El icónico diseño de perfil medio es más transpirable que nunca gracias a la plantilla perforada. Además, el diseño incorpora mensajes inspiradores basados en los orígenes de MJ para dar significado a cada una de tus pisadas."
    },
    {
      "id": "00003",
      "name": "Nike Structure 24",
      "size": "41, 42, 44, 45",
      "price": "90,97",
      "color": "Negro/Ashen Slate/Cobalt Bliss/Blanco",
      "type": "Zapatillas de running para asfalto - Hombre",
      "description": "Las Nike Structure 24 te preparan para salir al asfalto. Hemos usado datos de pruebas a cientos de runners para diseñar la almohadilla articulada debajo del talón que crea una transición suave y amortiguada hasta la puntera. Además, estos datos nos han ayudado a crear una parte superior ventilada con transpirabilidad justo donde más la necesitas."
    },
    {
      "id": "00004",
      "name": "Nike Flex Experience Run 11 Next Nature",
      "size": "41, 42, 44, 45",
      "price": "48,97",
      "color": "Aviator Grey/Plata metalizado/Negro",
      "type": "Zapatillas de running para asfalto - Hombre",
      "description": "Cómodas y llenas de ambiente zen, como deberían ser tus sesiones de running. En las Nike Flex Experience Run 11 Next Nature, hemos creado un diseño ligero y sencillo que ofrece una sensación y un look excelentes. Las zapatillas ofrecen una gran sujeción donde más la necesitas y te permite moverte libremente."
    },
    {
      "id": "00005",
      "name": "Nike Pegasus Turbo Next Nature",
      "size": "35",
      "price": "159,99",
      "color": "Negro/Off Noir/Sesame/Sail",
      "type": "Zapatillas de running para asfalto - Mujer",
      "description": "Deja que las Nike Pegasus Turbo Next Nature te ayuden a completar los kilómetros más duros. Confeccionadas con, al menos, un 50 % de contenido reciclado por peso total del producto, este codiciado modelo ofrece elasticidad y la sensación perfecta. Con una espuma más ligera y reactiva, esta prenda se ha diseñado para aumentar el ritmo sin sacrificar la comodidad mientras alcanzas tu mejor marca personal."
    },
    {
      "id": "00006",
      "name": "Nike Revolution 6 Next Nature",
      "size": "35",
      "price": "64,99",
      "color": "Sanddrift/Topaz Gold/Indigo Haze/Blanco",
      "type": "Zapatillas de running para asfalto - Mujer",
      "description": "Confeccionados con, al menos, un 20 % de material reciclado por peso, los materiales antiguos de este diseño empiezan una nueva vida.Ahora tú también puedes.Empieza con buen pie en el running con la suavidad de las Nike Revolution 6 Next Nature.Sabemos que la comodidad es clave para correr bien, y con estas zapatillas disfrutarás de una pisada suave gracias a su amortiguación y flexibilidad.Este diseño transpirable es una evolución de uno de los modelos más populares."
    },
    {
      "id": "00007",
      "name": "Nike Tanjun",
      "size": "35",
      "price": "44,97",
      "color": "Wolf Grey/Barely Volt/Negro/Blanco",
      "type": "Zapatillas - Mujer",
      "description": "No exageramos. Las Nike Tanjun ofrecen la máxima simplicidad. Confeccionadas con, al menos, un 20 % de contenido reciclado y cordones confeccionados al 100 % con poliéster reciclado, estas zapatillas no pasan ningún detalle por alto. Ligereza. Ventilación. Comodidad. Son más que palabras. Estas zapatillas son todo lo que necesitas."
    },
    {
      "id": "00008",
      "name": "Nike Air Max Flyknit Racer",
      "size": "35",
      "price": "71,97",
      "color": "Sesame/Ocean Cube/Pink Oxford/Negro",
      "type": "Zapatillas - Mujer",
      "description": "No te olvides de tu herencia. Nunca. Para rendir homenaje a la tradición y a la innovación, hemos combinado dos iconos para ir más allá de lo esperado. El tejido Flyknit ligero y ventilado con una sutil combinación de colores combina a la perfección la amortiguación Air Max y la tracción resistente. Descubre la comodidad al atártelas."
    },
    {
      "name": "Nike Air Max Alpha Trainer 5",
      "size": 41,
      "price": 84.99,
      "color": "Blanco/Carmesí brillante/Obsidian",
      "type": "Zapatillas Hombre",
      "description": "Dalo todo en tu última repetición con potencia y acaba con un rugido que resuene en todo el gimnasio con las Nike Air Max Alpha Trainer 5. La amortiguación Max Air ofrece una estabilidad cómoda para el levantamiento de pesas ligera o pesadas. La amplia base plana ofrece una mayor estabilidad y agarre para todo tipo de entrenamientos exigentes sin sacrificar el estilo mientras cambias de serie o estación.",
      "alt_img": "https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco/7f6133f8-52c8-4b28-b0f1-066c58dff6fc/air-max-alpha-trainer-5-zapatillas-de-entrenamiento-R7lFbj.png",
      "id": "EPfNzw1"
    },
    {
      "name": "Nike Metcon 8 ",
      "size": 41,
      "price": 139.99,
      "color": "Anthracite/Hyper Royal/Citron Tint",
      "type": "Zapatillas de entrenamiento - Hombre",
      "description": "Vas siempre a contrarreloj, y animas y retas a los demás a alcanzar sus objetivos y ventajas. Nuestro modelo ideal para el entrenamiento cuenta con una parte superior más ligera y transpirable que la de nuestra edición anterior para satisfacer nuestros estándares de durabilidad y comodidad y que puedas hacer ejercicios de cardio, darlo todo en los levantamientos y dominar tus entrenamientos.",
      "alt_img": "https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco/543f44ec-73ae-4bd1-b480-32b10f38871b/metcon-8-zapatillas-de-entrenamiento-lFNllk.png",
      "id": "mekSNeh"
    },
    {
      "name": "Nike x G-Dragon",
      "size": "S,M,L",
      "price": 349.99,
      "color": "Negro",
      "type": "Chaqueta 2 en 1",
      "description": "¿Hay algo que G-Dragon no sepa hacer? Como superestrella del K-pop y director creativo de su propia marca, Peaceminusone, sabe cómo maximizar su potencial, y así lo ha hecho en esta colección. Inspirándose en el estilo de vida \"Freedom in Flow\" y en el taekwondo, deporte tradicional coreano, G-Dragon da su toque personal a unos looks increíbles.",
      "alt_img": "https://static.nike.com/a/images/c_limit,w_592,f_auto/t_product_v1/16343304-044c-494f-96e6-658451399d84/g-dragon-chaqueta-2-en-1.png",
      "id": "BHJciN7"
    },
    {
      "name": "Nike Sportswear Tech Fleece Windrunner",
      "size": "XS, S, M, L XL, XXL",
      "price": 103.97,
      "color": "Black",
      "type": "Sudadera con capucha con cremallera completa - Hombre",
      "description": "Con una combinación de dos de nuestros looks más icónicos, esta sudadera con capucha y cremallera completa está inspirada en nuestra atemporal chaqueta Windrunner y en la chaqueta Tech Fleece. Diseño holgado en los hombros, el pecho y el cuerpo para ofrecer un ajuste deportivo que puedes combinar con otras prendas. Nuestro tejido Fleece premium tiene un tacto agradable en ambos lados y ofrece más suavidad y calidez que nunca, además de una confección ligera.",
      "alt_img": "https://static.nike.com/a/images/c_limit,w_592,f_auto/t_product_v1/0694e6a7-099c-401b-8a12-b4c2fd206cc8/sportswear-tech-fleece-windrunner-sudadera-con-capucha-con-cremallera-completa-gsvHWq.png",
      "id": "mTzB7Y-"
    }
  ]
}